# 7.4

group1 = [
    "Базылев", "Белова", "Волкова", "Ерастов", "Мишкова",
    "Пилясова", "Щеберова", "Шаронов", "Смирнов", "Кононенко"
]

group2 = [
    "Аминов", "Бирюкова", "Горлинский", "Грищенко", "Гудеев",
    "Дворянинова", "Егоров", "Заец", "Клименко", "Светлакова"
]

team = tuple(group1[:5] + group2[:5]) # a Спортивная команда 

print("Первая группа:", group1)
print("Вторая группа:", group2)
print("Спортивная команда:", team) # b Вывод списков и кортежа

print("Длина команды:", len(team)) # c Длина кортежа

sorted_team = tuple(sorted(team))
print("Команда по алфавиту:", sorted_team) # d Сортировка по алфавиту

if "Мишкова" in team:
    print("Студент Мишкова входит в команду")
else:
    print("Студент Мишкова не входит в команду") # e Проверка фамилии Мишкова

print("Фамилия Мишкова встречается",
      team.count("Мишкова"), "раз(а)")